app/controllers/authors_controller.rb

  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save
---
INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "test"], ["created_at", "2018-10-25 10:42:33.975650"], ["updated_at", "2018-10-25 10:42:33.975650"]]