app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test movie"], ["author_id", 1], ["created_at", "2018-10-25 10:49:20.098422"], ["updated_at", "2018-10-25 10:49:20.098422"]]
---
  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save