app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params.merge({:user_id => current_user.id}))

    respond_to do |format|
      if @review.save
---
INSERT INTO "reviews" ("user_id", "movie_id", "rating", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["movie_id", 1], ["rating", 10], ["text", "First rate"], ["created_at", "2018-10-25 11:26:49.074578"], ["updated_at", "2018-10-25 11:26:49.074578"]]

  def update
    respond_to do |format|
      if !current_user.id == @review.user.id
        render json: "User does not own this review", status: :unprocessable_entity
      elsif @review.update(review_params)
---
UPDATE "reviews" SET "rating" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["rating", 1], ["updated_at", "2018-10-25 11:59:16.402913"], ["id", 2]]