app/controllers/sessions_controller.rb

  def create
    if current_user
      render json: {error: "User already logged in"}, :status => :unprocessable_entity
    else
      user = User.find_by_username(params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "test"], ["LIMIT", 1]]